In [1]:
file = open('data.csv', 'x')
file.close()

In [2]:
import pandas as pd

In [20]:
df = pd.read_csv("data.csv", index_col='sn') # use sn as index column

In [52]:
df

      name  age
sn
1      Ram   45
2    Shyam   89
3    Sabin   45
4   Parbat   22
5    Bikul   21
6     Aman   20

In [56]:
df = pd.read_csv("data.csv") # use usecolns to filter colns
df

   sn    name  age    address
0   1     Ram   45  Kathmandu
1   2   Shyam   89   Lalitpur
2   3   Sabin   45      Jhapa
3   4  Parbat   22    Itahari
4   5   Bikul   21  Kathmandu
5   6    Aman   20    Birgunj

In [35]:
###

In [54]:
print(df[['age','name']])  #i indexing columns

   age    name
0   45     Ram
1   89   Shyam
2   45   Sabin
3   22  Parbat
4   21   Bikul
5   20    Aman

In [38]:
#

In [39]:
# df.head(3)

In [40]:
# df.tail(4)

In [26]:
df.iloc[2::]  # iloc is used to index data within certain range

      name  age    address
sn
3    Sabin   45      Jhapa
4   Parbat   22    Itahari
5    Bikul   21  Kathmandu
6     Aman   20    Birgunj

In [45]:
# iloc is used to index data within certain range
df.iloc[2:5]

      name  age
sn
3    Sabin   45
4   Parbat   22
5    Bikul   21

In [46]:
# loc is used to index exact position ## does not count integers as array
df.loc[2:5]

      name  age
sn
2    Shyam   89
3    Sabin   45
4   Parbat   22
5    Bikul   21

In [43]:
df.iloc[2:5]

      name  age
sn
3    Sabin   45
4   Parbat   22
5    Bikul   21

In [61]:
df.loc[df['address'] == 'Kathmandu'] ## using conditions

   sn   name  age    address
0   1    Ram   45  Kathmandu
4   5  Bikul   21  Kathmandu

In [62]:
df = pd.read_csv('data.csv', index_col='sn')

In [64]:
df = df[df['age'] > 5]
df

      name  age    address
sn
1      Ram   45  Kathmandu
2    Shyam   89   Lalitpur
3    Sabin   45      Jhapa
4   Parbat   22    Itahari
5    Bikul   21  Kathmandu
6     Aman   20    Birgunj

In [65]:
df.to_csv('new_data.csv', index=False)

In [67]:
data = {'name':['Ram', 'Shyam', 'Hari'],  # list inside dictionary
        'age' : [45,67,89],
        'add' : ['Kathmandu', 'Bhaktapur', 'Lalitpur']  
}
df = pd.DataFrame(data)  # converting list to dataframe
df

    name  age        add
0    Ram   45  Kathmandu
1  Shyam   67  Bhaktapur
2   Hari   89   Lalitpur

In [73]:
data = [
    ['name', 'age', 'add'],
    ['Ram', '45', 'Kathmandu'],
    ['Shyam', '67', 'Bhaktapur'],
    ['Hari', '67', 'Lalitpur']
]
import csv
file = open('list_data.csv', 'w')
x = csv.writer(file)
x.writerows(data)
file.close()

In [74]:
df = pd.read_csv('list_data.csv')

In [75]:
df

    name  age        add
0    Ram   45  Kathmandu
1  Shyam   67  Bhaktapur
2   Hari   67   Lalitpur